app/controllers/genres_controller.rb

SELECT "genres".* FROM "genres"
---
  def index
    @genres = Genre.all

INSERT INTO "genres" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2017-12-08 20:43:56.991911"], ["updated_at", "2017-12-08 20:43:56.991911"]]
---
  def create
    @genre = Genre.new(genre_params)

    if @genre.save