app/controllers/movies_controller.rb

  def index
    if @single_user.present?
      @movies = @single_user.watchlist
    else
      @movies = params[:genre].present?? Genre.where(name: params[:genre]).first.movies : Movie.all
      if(params[:criteria].present?)
        @movies = @movies.order(params[:criteria].to_sym).all
---
SELECT  "genres".* FROM "genres" WHERE "genres"."name" = $1 ORDER BY "genres"."id" ASC LIMIT $2  [["name", "comedy"], ["LIMIT", 1]]
SELECT "movies".* FROM "movies" INNER JOIN "genres_movies" ON "movies"."id" = "genres_movies"."movie_id" WHERE "genres_movies"."genre_id" = $1  [["genre_id", 2]]
SELECT "movies".* FROM "movies"

  def create
    @movie = Movie.new(create_movie_params)

    if @movie.save
---
INSERT INTO "movies" ("imdbID", "Title", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["imdbID", "12424"], ["Title", "hello its me"], ["created_at", "2017-12-08 16:01:23.425919"], ["updated_at", "2017-12-08 16:01:23.425919"]]

  def destroy
    @movie.destroy
---
DELETE FROM "movies" WHERE "movies"."id" = $1  [["id", 3]]

    def set_movie
      @movie = Movie.find(params[:id])
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]