app/controllers/ratings_controller.rb

  def index
    if(@single_user.present?)
      @ratings = @single_user.ratings
    else
      if params[:movie_id].present?
        @ratings = Rating.where(movie_id: params[:movie_id]).all
      else
        @ratings = Rating.all
---
SELECT "ratings".* FROM "ratings" WHERE "ratings"."movie_id" = $1  [["movie_id", 1]]
SELECT "ratings".* FROM "ratings" WHERE "ratings"."user_id" = $1  [["user_id", 1]]

  def create
    @rating = Rating.new(rating_params)

    if @rating.save
---
INSERT INTO "ratings" ("rating", "review", "user_id", "movie_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["rating", "3.5"], ["review", "shfbsnfsjknf"], ["user_id", 3], ["movie_id", 1], ["created_at", "2017-12-08 16:06:26.360651"], ["updated_at", "2017-12-08 16:06:26.360651"]]

    def set_rating
      @rating = Rating.find(params[:id])
---
SELECT  "ratings".* FROM "ratings" WHERE "ratings"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def set_single_user
      if(params[:user_id].blank? && request.url["users"].blank? && request.url["user"].present?)
        @single_user = current_user
      elsif (params[:user_id].present?)
        @single_user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]