app/controllers/recommendations_controller.rb

  def index
    if @single_user.present?
      if params[:status].present?
        @recommendations = @single_user.recommendations.send(params[:status].to_sym)
      else
        @recommendations = @single_user.recommendations
      end
    elsif params[:movie_id].present?
        @recommendations = Movie.find(params[:movie_id]).recommendations
    else
        @recommendations = Recommendation.all
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "recommendations".* FROM "recommendations" WHERE "recommendations"."movie_id" = $1  [["movie_id", 1]]
SELECT "recommendations".* FROM "recommendations"

  def create
    @recommendation = Recommendation.new(recommendation_params)

    if @recommendation.save
---
INSERT INTO "recommendations" ("from_user_id", "to_user_id", "movie_id", "ExpectedRating", "UserRating", "Message", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def update
    if @recommendation.update(recommendation_params)
---
UPDATE "recommendations" SET "UserRating" = $1, "updated_at" = $2 WHERE "recommendations"."id" = $3  [["UserRating", "1.2"], ["updated_at", "2017-12-08 16:36:03.904119"], ["id", 1]]

    def set_recommendation
      @recommendation = Recommendation.find(params[:id] || params[:recommendation_id])
---
SELECT  "recommendations".* FROM "recommendations" WHERE "recommendations"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]

    def set_single_user
      if(params[:user_id].blank? && request.url["users"].blank? && request.url["user"].present?)
        @single_user = current_user
      elsif (params[:user_id].present?)
        @single_user = User.find(params[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]