app/controllers/users_controller.rb

  def create
    @user = User.new(create_user_params)

    if @user.save
---
INSERT INTO "users" ("UserName", "Email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def update
    if @user.update(user_params)
---
UPDATE "users" SET "UserName" = $1, "Email" = $2, "password_digest" = $3, "updated_at" = $4 WHERE "users"."id" = $5  [["UserName", "aaaa"], ["Email", "aa@g.com"], ["password_digest", "$2a$10$Vt3ef7jZ4YcW6jNtGsMqkevw/xOZg5BR/9xQP4Cye/GD.XxfzS2de"], ["updated_at", "2017-12-08 16:41:12.257307"], ["id", 3]]

    def set_user
      if(params[:id].present?)
        @user = User.find(params[:id])
      else
        @user = User.first
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]
SELECT  "users".* FROM "users" ORDER BY "users"."id" ASC LIMIT $1  [["LIMIT", 1]]